import { HttpClient } from '@angular/common/http';
import { Injectable } from '@angular/core';
import { Subject } from 'rxjs';
import { Event } from './event.model';

@Injectable({
  providedIn: 'root'
})
export class EventCardService {


  currentPage = new Subject<number>();
  currentPageNumber: number = 1;
  // events:Events[] = [
  //   new Events(
  //     'هشام',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     ''
  //   ),
  //   new Events(
  //     'هشام',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     ''
  //   ),
  //   new Events(
  //     'هشام',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     ''
  //   ),
  //   new Events(
  //     'هشام',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     ''
  //   ),
  //   new Events(
  //     'هشام',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     ''
  //   ),
  //   new Events(
  //     'هشام',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     ''
  //   ),
  // ];
  // allEvents:Events[]=[
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  //   new Events(
  //     'النظامى',
  //     'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا',
  //     ''
  //   ),
  // ];
  // events =  [
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },

  // ] ;
  // allEvents =  [
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هشام',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرااليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'النظامى',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  //   {
  //     title: 'هدير',
  //     img: 'https://mdbootstrap.com/img/Photos/Horizontal/Nature/4-col/img%20(34).jpg',
  //     desc: 'اليوم سوف نقوم بالتحقيق فى تلك القضية عن كثب من قبل فريق عمل مدرب على هذا الخرا ',
  //     link: ''
  //   },
  // ] ;
 allEvents:Event[] = [];

  constructor( private http: HttpClient) { }

  fetchData(){
    this.http.get('http://ahmed1500019-001-site1.dtempurl.com/api/Events').subscribe(
      (data:any) => {
        for(let i in data){
          if(data.hasOwnProperty(i)){
          this.allEvents.push(data[i]);
          }
        }
      }
    );
  }
  getHomeEvents(){
   var firstThreeEvents: any = [];
   for(let i = 0 ; i<3 ; i++){
     firstThreeEvents.push(this.allEvents[i]);
   }
    return firstThreeEvents.slice();
  }

  // getEvents(){
  //   return this.allEvents;
  // }

  // getEvent(id:number){
  //   return this.allEvents[id];
  // }

  // getEventsLenght(){
  //   return this.allEvents.length;
  // }

  getAllEvents(){
    return this.allEvents.slice();
  }
  getEventFromAllEvents(id:number){
    return this.allEvents[id];
  }
  getAllEventsLength(){
    return this.allEvents.length;
  }

}
